In [1]:
import pandas as pd

In [2]:
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [3]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [4]:
#Ans 1)
df[1:2]

        course_name  duration
1  Machine Learning         3

#Ans 2) The loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select. This method includes the last element of the range passed in it, unlike iloc(). loc() can accept the boolean data unlike iloc(). Many operations can be performed using the loc() method like
. Selecting data according to some conditions
. Selecting a range of rows from the DataFrame
. Updating the value of any column

The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it unlike loc(). iloc() does not accept the boolean data unlike loc(). Operations performed using iloc() are:
. Selecting rows using integer indices
# selecting 0th, 2nd, 4th, and 7th index rows
display(data.iloc[[0, 2, 4, 7]])
. Selecting a range of columns and rows simultaneously
  # selecting rows from 1 to 4 and columns from 2 to 4
display(data.iloc[1: 5, 2: 5])

In [5]:
#Ans 3)
reindex = [3,0,1,2]
new_df = df.reindex(reindex)

In [6]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [7]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [8]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

The new_df.loc[2] fetched 'Big data' as this is the location of 2nd index whereas the new_df.iloc[2] fetched 'Machine Learning' as iloc fetches the inbuilt index. In this case the , the inbuilt index
2 contains the 'Machine Learning'

In [24]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [25]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.886992  0.909266  0.430424  0.820387  0.341291  0.375907
2  0.995969  0.697514  0.210081  0.861347  0.000069  0.584047
3  0.117568  0.909790  0.463393  0.147935  0.652561  0.145671
4  0.884335  0.122768  0.420575  0.216562  0.083000  0.577929
5  0.055528  0.850207  0.788884  0.410982  0.747012  0.246335
6  0.746082  0.001467  0.400694  0.283383  0.851782  0.394434

In [26]:
#Ans 4) i)
df1.mean()

column_1    0.614412
column_2    0.581835
column_3    0.452342
column_4    0.456766
column_5    0.445952
column_6    0.387387
dtype: float64

In [27]:
#Ans 4) ii)
df1['column_2'].std()

0.4117622125615995

In [28]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.886992  0.909266  0.430424  0.820387  0.341291  0.375907
2  0.995969  0.697514  0.210081  0.861347  0.000069  0.584047
3  0.117568  0.909790  0.463393  0.147935  0.652561  0.145671
4  0.884335  0.122768  0.420575  0.216562  0.083000  0.577929
5  0.055528  0.850207  0.788884  0.410982  0.747012  0.246335
6  0.746082  0.001467  0.400694  0.283383  0.851782  0.394434

In [32]:
#Ans 5)
df1['column_2'].loc[2] = 'Hello'

In [33]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.886992  0.909266  0.430424  0.820387  0.341291  0.375907
2  0.995969     Hello  0.210081  0.861347  0.000069  0.584047
3  0.117568   0.90979  0.463393  0.147935  0.652561  0.145671
4  0.884335  0.122768  0.420575  0.216562  0.083000  0.577929
5  0.055528  0.850207  0.788884  0.410982  0.747012  0.246335
6  0.746082  0.001467  0.400694  0.283383  0.851782  0.394434

In [34]:
df1['column_2'].mean()

TypeError: unsupported operand type(s) for +: 'float' and 'str'

The mean method works on number values and since we have a string 'hello' it canot work.

# Ans 6 )
The window functions in Pandas are used to perform some sort of calculations across a set of rows that are interrelated with the current row. 
The windows functions help us to perform the aggregated calculations across various partitions or cross-sections of the data.
Some windows functions are :
    1) .rolling() Function
This function can be applied on a series of data. Specify the window=n argument and apply the appropriate statistical function on top of it.
2) cumsum() : This is cumulative sum
3) sum() 
4) min(), max() etc

In [39]:
#Ans 7)
pd.datetime.now().year

/tmp/ipykernel_128/952388114.py:2: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  pd.datetime.now().year

2023

In [40]:
pd.datetime.now().month

/tmp/ipykernel_128/880839337.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  pd.datetime.now().month

3

In [42]:
#Ans 8)
date1 = input("enter dat1 in format YYYY-MM-DD")
date2 = input("enter dat1 in format YYYY-MM-DD")
t1 = pd.to_datetime(date1)
t2 = pd.to_datetime(date2)
data = {'todate': [pd.Timestamp(t1)],
        'fromdate': [pd.Timestamp(t2)]}

#df = pd.DataFrame(data)
pd.Timedelta(t2 - t1)

enter dat1 in format YYYY-MM-DD 2023-03-07
enter dat1 in format YYYY-MM-DD 2023-03-08

Timedelta('1 days 00:00:00')

In [55]:
#Ans 9)
d1 = input('Enter path of scv')
df = pd.read_csv(d1)

Enter path of scv https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv

In [56]:
d2 = input('Enter categorical column')
df[d2] = pd.Categorical(df[d2])

Enter categorical column Sex

In [57]:
df.sort_values(by="Age", inplace=True)

In [58]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [86]:
# Ans 11)
filepath = input('Enter csv path')
df = pd.read_csv(filepath)

Enter csv path student_data_new.csv

In [87]:
df

    student_id  Score
0          NaN    NaN
1          1.0  765.0
2          2.0  879.0
3          3.0  654.0
4          4.0  987.0
5          6.0  567.0
6          8.0  887.0
7          9.0  876.0
8         10.0  578.0
9         11.0  789.0
10        12.0  765.0
11        13.0  678.0
12        14.0  866.0
13        15.0  909.0
14        16.0  999.0
15        17.0  987.0
16        19.0  788.0
17        20.0  768.0
18        21.0  876.0
19        22.0  987.0
20        24.0  698.0
21        23.0  987.0
22        25.0  820.0

In [88]:
dmean = df['Score'].mean()
dmedian = df['Score'].median()
dmode = df['Score'].mode()

In [89]:
print('+-----------+--------+')
print('| Statistic | Value |')
print('+-----------+--------+')
print('| Mean | ',dmean,' |')
print('| Median | ',dmean,' |')
print('| Mode | ',dmode,' |')

+-----------+--------+
| Statistic | Value |
+-----------+--------+
| Mean |  823.1818181818181  |
| Median |  823.1818181818181  |
| Mode |  0    987.0
Name: Score, dtype: float64  |